{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string",
      "metadata": {
        "description": "The name of the Log Analytics workspace."
      }
    },
    "workspaceLocation": {
      "type": "string",
      "metadata": {
        "description": "The location of the Log Analytics workspace."
      }
    }
  },
  "variables": {},
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "apiVersion": "2020-01-01",
      "name": "[concat(parameters('workspaceName'), '/Microsoft.SecurityInsights/', 'SuccessfulDiagnosticSettingsDeletion')]",
      "kind": "Scheduled",
      "location": "[parameters('workspaceLocation')]",
      "properties": {
        "displayName": "Successful Diagnostic Settings Deletion",
        "description": "Detects successful deletion of Azure Diagnostic Settings, which could indicate an attempt to remove logging and monitoring for an environment. This could be part of an evasion or post-compromise activity.",
        "severity": "High",
        "enabled": true,
        "query": "AzureActivity\n| where OperationName == \"MICROSOFT.INSIGHTS/DIAGNOSTICSETTINGS/DELETE\"\n| where ActivityStatus == \"Success\"\n| summarize count() by Caller, ResourceGroup",
        "queryFrequency": "PT5M",
        "queryPeriod": "PT5M",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "tactics": [
          "DefenseEvasion"
        ],
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "customDetails": {},
        "alertDetailsOverride": {},
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "value": "Caller"
              }
            ]
          },
          {
            "entityType": "Resource",
            "fieldMappings": [
              {
                "identifier": "Name",
                "value": "ResourceGroup"
              }
            ]
          }
        ],
        "alertRuleTemplateName": null,
        "templateVersion": null,
        "sourceSettings": null,
        "autoEnable": true,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "sentinelMetaData": {
          "version": "4.0.0",
          "category": "Custom Rule",
          "providers": [
            "Microsoft"
          ]
        },
        "techniques": [],
        "alertDetails": null
      }
    }
  ],
  "outputs": {}
}